org/ArchLinux降级软件包.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-09-19 六>
#+TITLE: ArchLinux降级软件包

* 前言

今天考试，听KiteAB说QV2ray挂了，让我不要更新，回到宿舍还是忍不住滚了一下。随后，QV2ray果然挂了，原因是grpc包不兼容，所以就查了下如何降级软件包，下面简单说下。

* downgrade 降级软件包的软件包

最方便的方式是通过downgrade来进行降级，非常方便。

首先安装:

#+begin_src shell
pacman -S downgrade
#+end_src

随后只需要通过这条命令即可降级

#+begin_src shell
#downgrade 包名
downgrade grpc
#+end_src

#+begin_quote
   38)  grpc    1.30.0  1  x86_64  (远端)
   39)  grpc    1.30.0  2  x86_64  (远端)
   40)  grpc    1.30.1  1  x86_64  (远端)
-  41)  grpc    1.30.1  2  x86_64  (远端)
-  42)  grpc    1.30.1  2  x86_64  (本地)
+  43)  grpc    1.30.2  1  x86_64  (远端)
+  44)  grpc    1.30.2  1  x86_64  (本地)
-  45)  grpc    1.32.0  1  x86_64  (远端)
-  46)  grpc    1.32.0  1  x86_64  (本地)
   47)  grpc    1.32.0  2  x86_64  (远端)
输入数字以选择包：
#+end_quote

输入要降级的版本后即可。
